# Taps
tap "common-fate/granted"

# ---- Foundational ----
brew "git"            # brew git > macOS bundled (older version)
brew "stow"
brew "tmux"
brew "neovim"
brew "starship"
brew "zinit"          # zsh plugin manager; fetches plugins from GitHub (not brew versions)
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "yq"
brew "tlrc"
brew "git-delta"
brew "lazygit"
brew "yazi"
brew "httpie"

# ---- Toolchain managers ----
brew "mise"           # per-repo tool versions (matches work .mise.toml configs)
brew "tenv"           # terraform / tofu / terragrunt version switcher; reads .terraform-version
brew "uv"             # python end-to-end: versions + deps + scripts (replaces pyenv/venv/pipx)

# ---- Platform engineering ----
brew "gh"
brew "awscli"
brew "common-fate/granted/granted"   # AWS SSO role-assume + sso populate
# NOTE: terraform binary is managed by tenv, NOT brew, to avoid PATH conflicts
brew "tflint"
brew "terraform-docs"
brew "trivy"          # IaC + container vuln scanning
brew "kubectl"
brew "helm"
brew "k9s"
brew "kubectx"        # provides kubectx + kubens
brew "stern"          # multi-pod log tailer
brew "kustomize"
brew "colima"
brew "docker"
brew "docker-compose"
brew "lazydocker"
brew "direnv"
brew "sops"
brew "age"
brew "act"            # run GitHub Actions locally

# ---- Casks ----
cask "wezterm"
cask "visual-studio-code"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "font-meslo-lg-nerd-font"
